{"pageProps":{"slug":"2024-04-22-clt","post":{"slug":"2024-04-22-clt","title":"CLT x PJ","summary":"A manifest against CLT","dateString":"2024-04-22","tags":["salary","brasil"],"content":"\nThis is intended to explain to recruiters, friends and companies that I don't want to work as CLT - and how bad I think this model is.\n\nStarting as the simple one, and for both samples I am using a salary of 10k BRL/month to be easy to calculate.\n\n# _Pessoa Jurídica_ (PJ) or contractor\n\nThe company pays 10k BRL.\n\nAs a developer in Brazil providing services to US companies I don't need to pay ISS. So all the taxes I have is 7%.\n\n```\n7% of 10k BRL = 700 BRL\n10k BRL - 7% = 9300 BRL\n```\n\nIt means 9300 BRL comes to my pocket.\n\nI decide my retired plan.\n\nI decide my health insurance.\n\nI decide my benefits.\n\nThat is it. Simple like that.\n\nNow the bad part:\n\n# CLT - Labor Law\n\nFor all this I am using the values from [this tool](https://utilitarios.grupodpg.com.br/utilitarios/categoria/calculo-facil/775/custo-de-contratao-pj-x-clt-x-autnomo) - in portuguese.\n\nThe company pays the same 10k.\n\nMy salary officially would be 7.560 BRL.\n\n8% would be FGTS = 604,80 BRL. _Fundo de garantia por tempo de serviço_ (FGTS) or \"Service time guarantee fund\" it is a money that \"does not earn interest\", that I can access only to buy a house or during retirement.\n\n9% is 13º salary = 680,40 BRL. No reason to receive a piece of my salary only in the end of year, also does not earn interest.\n\n11,97% is vacations = 904,93 BRL. I need to pay each month to be able to take vacations, 30 days, max 3 intervals.\n\nCompany also pays 40% of all my FGTS in case I am fired by them (around 241,92 BRL). It is called _seguro desemprego_ or unemployment insurance.\n\n7% is INSS = 513,01 BRL. This is the retirement plan from the government. And it is not mine, in Brazil we pay for the ones retired. And our demographic window is not getting better.\n\n14% is IRPF = 1.068,56 BRL. _Imposto de Renda Pessoa Física_ or Personal Income Tax is tax. Simple like that.\n\nSo, in the end of month what I receive is 5.978,43 BRL. 60% of what company pays. Ok, you can argue that INSS/FGTS/13 Salary/vacations is something that I received, but there are several extra steps and it is delegated to the government to manage.\n\n# Ok, what else?\n\nQ: \"oh, but I have other benefits in CLT like gym / health insurance\".\nA: there is no magic. If company is paying extra, this money could come direct to my pocket.\n\nQ: \"how about exchange rate fluctuation?\"\nA: do you really think Brazilian real will behave better than any other currency? Just search on google things like `1 BRL in USD` / `1 BRL in EUR` / etc and check the graphic.\n\nQ: \"but if something bad happen? e.g. accident, fired\"\nA: I prefer to contract the insurances myself. I do have my emergency reserve, and unlike the one from the government mine does earn interest.\n\n# Which tool did I use?\n\nBasically [this one](https://utilitarios.grupodpg.com.br/utilitarios/categoria/calculo-facil/775/custo-de-contratao-pj-x-clt-x-autnomo).\n\nhttps://numbr.dev is also great to play with it real time and share.\n\n# Conclusion\n\nI don't like CLT. I don't want CLT. I don't see value to pass ownership of things to government. No reason to pay 27% of taxes if I can pay 7%.\n\nTo be clear, one FAANG / MANGA (Meta / Apple / Netflix / Google / Amazon) offered me to be CLT. MANGA is a dream for almost every developer, but I said no just because I don't see a point in CLT.\n\nAnd if you (LATAM developer) that have the option to choose I really hope you decide by PJ/contractor.\n"}},"__N_SSG":true}